
public class Test1 {

	public static void main(String[] args) {

		// 식별자 규칙 사용하기
		// => 변수의 이름 지정
		// 1. 영문자, 숫자 조합으로 사용
		// 2. 반드시 첫글자는 영문자(-,$는 사용가능)
		// int _number; $도 사용가능. 첫 글자는 영문자,_,$ 사용가능
		// int @number; 사용못함, 똑같은 변수도 사용못함
		// 3. 동일한 이름 사용 불가
		// 4. 대소문자 구분
		// 5. 예약어를 사용할 수 없음.

		// int Lotto_number; 같은 경우 변수의 성격을 알 수 있으니 이름을 잘 작성하는게 중요
		// int LottoNumber; =>카멜(낙타 등모양) 표기법 (2이상의 단어를 연결시 단어 첫글자를 대문자로)
		// int LottoNUMBER; 위와 같으?
		// 예약어는 사용을 못하며 색깔이 다르다
		// 기본 테마 :자주색 // 테마가 바껴서 모르겠으면 아무 예약어를 입력하면 나타나는 색깔...)
		
		// * 클래스명은 반드시 첫글자 영어 대문자로 사용(개발자들 사이에 암묵적 규칙)

		// 변수 : 데이터를 저장하는 공간 (메모리, RAM에 공간이 생성됨)
		// -> 공간마다 저장할 수 있는 데이터 타입이 다르다.

		// 변수 선언 (쓰겠다 준비한 것)
		int number;
		// ↑[데이터 타입] [변수명];
		// * 동일한 이름의 변수명 사용 불가 (식별의 목적이므로)
		
		// * 데이터 타입
		// 1. 기본형 데이터 타입 (8가지)
		// 논리형 - boolean -1byte(의 저장공간을 필요로 한다)
		// 문자형 - char - 2byte
		// 정수형 - byte, short, int, long
		//			1	  2	  	3 	  4	
		// 실수형 - float, double
		//			4 		8	
		// 2. 참조형 데이터 타입
		// 기본형 데이터 타입 8개를 제외한 모든 타입
		// 
		
		
		
		
		

	
	}

}
